lixpaulian/efr32xx-rail/platform/base/hal/plugin/serial/cortexm/efm32/com.c
/***************************************************************************//**
 * @file com.c
 * @brief COM Layer.
 * @version 0.01.0
 *******************************************************************************
 * @section License
 * <b>(C) Copyright 2014 Silicon Labs, http://www.silabs.com</b>
 *******************************************************************************
 *
 * This file is licensed under the Silabs License Agreement. See the file
 * "Silabs_License_Agreement.txt" for details. Before using this software for
 * any purpose, you must agree to the terms of that agreement.
 *
 *
 ******************************************************************************/

#include PLATFORM_HEADER
#include "stack/include/ember-types.h"
#include "stack/include/error.h"

#include "hal/hal.h"

#include <stdarg.h>

#ifdef CORTEXM3_EFM32_MICRO
#include "em_device.h"
#include "em_usart.h"
#include "em_core.h"
#endif

#include "serial/com.h"
#include "serial/com_config.h"
#include "serial/ember-printf.h"

// Set COM_UART_ENABLE if at least one UART is enabled
#if (defined(COM_USART0_ENABLE)  \
  || defined(COM_USART1_ENABLE)  \
  || defined(COM_USART2_ENABLE)  \
  || defined(COM_USART3_ENABLE)  \
  || defined(COM_LEUART0_ENABLE) \
  || defined(COM_LEUART1_ENABLE))
#define COM_UART_ENABLE
#endif

#if defined (COM_VCP_ENABLE) || defined (COM_UART_ENABLE)
// Only include code if COM ports are enabled. Stub functions out otherwise.

// --------------------------------
// Static declarations
static inline bool checkValidPort(COM_Port_t port);
static bool checkValidThresholds(COM_Handle_t comhandle);
static void dequeueFifoBuffer(COM_Handle_t comhandle, uint16_t count);
static COM_Handle_t getComHandleFromPort(COM_Port_t port);
static inline bool getOutputFifoSpace(COM_Handle_t comhandle, uint8_t extraByteCount);
static inline bool getInputFifoSpace(COM_Handle_t comhandle, uint8_t extraByteCount);
static Ecode_t setComHandleQueues(COM_Port_t port);
static void txBuffer(COM_Port_t port, uint8_t *data, uint16_t length);
static void updateBuffer(COM_FifoQueue_t *q, uint16_t xferred, uint16_t size);

#if defined(COM_VCP_ENABLE)
static inline bool checkValidVcpPort(COM_Port_t port);

#endif

#if defined(COM_UART_ENABLE)
static inline bool checkValidUartPort(COM_Port_t port);
static void enableRxIrq(COM_Port_t port, bool enable);
static UARTDRV_Handle_t getUartHandleFromPort(COM_Port_t port);
static void rxCallback(UARTDRV_Handle_t handle,
                       Ecode_t transferStatus,
                       uint8_t *data,
                       UARTDRV_Count_t transferCount);
static void rxNextBuffer(COM_Handle_t handle);
static Ecode_t setUartBufferQueues(COM_Port_t port, COM_Init_t * init);
static void txCatchUp(COM_Handle_t comhandle);
static void txCallback(UARTDRV_Handle_t handle,
                       Ecode_t transferStatus,
                       uint8_t *data,
                       UARTDRV_Count_t transferCount);

#endif

#if HAL_SERIAL_RXWAKE_ENABLE
static void rxGpioIntEnable(void);
static void rxGpioIntDisable(void);
#endif
/* Initialization data and buffer queues */

// -------------------------------------------------------------------------
// The macro DEFINE_BUF_QUEUE() can only be used for static definition of
// buffer queues, which includes a struct typedef. Since it is always used
// in a standalone fashion, this expansion will not interfere with any other
// logic and does not require enclosing parentheses
//cstat -MISRAC2012-Rule-20.7
// -------------------------------------------------------------------------
#ifdef COM_VCP_ENABLE
//add VCP support
  #include "hal/plugin/debug-jtag/debug-channel.h"

/* FIFO Buffers */
DEFINE_FIFO_QUEUE(COM_VCP_RX_QUEUE_SIZE, comFifoQueueRxVcp)
DEFINE_FIFO_QUEUE(COM_VCP_TX_QUEUE_SIZE, comFifoQueueTxVcp)
#endif //COM_VCP_ENABLE

#ifdef COM_USART0_ENABLE

/* UARTDRV buffer queues */
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_RX_BUFS, comBufferQueueRxUsart0);
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_TX_BUFS, comBufferQueueTxUsart0);

/* COM FIFO Buffers */
DEFINE_FIFO_QUEUE(COM_USART0_RX_QUEUE_SIZE, comFifoQueueRxUsart0)
DEFINE_FIFO_QUEUE(COM_USART0_TX_QUEUE_SIZE, comFifoQueueTxUsart0)
#endif

#ifdef COM_USART1_ENABLE

/* UARTDRV buffer queues */
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_RX_BUFS, comBufferQueueRxUsart1);
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_TX_BUFS, comBufferQueueTxUsart1);

/* COM FIFO Buffers */
DEFINE_FIFO_QUEUE(COM_USART1_RX_QUEUE_SIZE, comFifoQueueRxUsart1)
DEFINE_FIFO_QUEUE(COM_USART1_TX_QUEUE_SIZE, comFifoQueueTxUsart1)
#endif

#ifdef COM_USART2_ENABLE

/* UARTDRV buffer queues */
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_RX_BUFS, comBufferQueueRxUsart2);
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_TX_BUFS, comBufferQueueTxUsart2);

/* COM FIFO Buffers */
DEFINE_FIFO_QUEUE(COM_USART2_RX_QUEUE_SIZE, comFifoQueueRxUsart2)
DEFINE_FIFO_QUEUE(COM_USART2_TX_QUEUE_SIZE, comFifoQueueTxUsart2)
#endif

#ifdef COM_USART3_ENABLE

/* UARTDRV buffer queues */
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_RX_BUFS, comBufferQueueRxUsart3);
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_TX_BUFS, comBufferQueueTxUsart3);

/* COM FIFO Buffers */
DEFINE_FIFO_QUEUE(COM_USART3_RX_QUEUE_SIZE, comFifoQueueRxUsart3)
DEFINE_FIFO_QUEUE(COM_USART3_TX_QUEUE_SIZE, comFifoQueueTxUsart3)
#endif

#ifdef COM_USB_ENABLE

/* COM FIFO Buffers */
DEFINE_FIFO_QUEUE(COM_USB_RX_QUEUE_SIZE, comFifoQueueRxUsb)
DEFINE_FIFO_QUEUE(COM_USB_TX_QUEUE_SIZE, comFifoQueueTxUsb)
#endif

#ifdef COM_LEUART0_ENABLE

/* UARTDRV buffer queues */
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_RX_BUFS, comBufferQueueRxLeuart0);
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_TX_BUFS, comBufferQueueTxLeuart0);

/* COM FIFO Buffers */
DEFINE_FIFO_QUEUE(COM_LEUART0_RX_QUEUE_SIZE, comFifoQueueRxLeuart0)
DEFINE_FIFO_QUEUE(COM_LEUART0_TX_QUEUE_SIZE, comFifoQueueTxLeuart0)
#endif

#ifdef COM_LEUART1_ENABLE

/* UARTDRV buffer queues */
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_RX_BUFS, comBufferQueueRxLeuart1);
DEFINE_BUF_QUEUE(EMDRV_UARTDRV_MAX_CONCURRENT_TX_BUFS, comBufferQueueTxLeuart1);

/* COM FIFO Buffers */
DEFINE_FIFO_QUEUE(COM_LEUART1_RX_QUEUE_SIZE, comFifoQueueRxLeuart1)
DEFINE_FIFO_QUEUE(COM_LEUART1_TX_QUEUE_SIZE, comFifoQueueTxLeuart1)
#endif
// -------------------------------------------------------------------------
// Re-enable enclosing parentheses CSTAT rule
//cstat +MISRAC2012-Rule-20.7
// -------------------------------------------------------------------------
// --------------------------------
// COM handle array indexes
typedef enum COM_HandleIndex {
#ifdef COM_VCP_ENABLE
  comHandleIndexVcp,
#endif
#ifdef COM_USART0_ENABLE
  comHandleIndexUsart0,
#endif
#ifdef COM_USART1_ENABLE
  comHandleIndexUsart1,
#endif
#ifdef COM_USART2_ENABLE
  comHandleIndexUsart2,
#endif
#ifdef COM_USART3_ENABLE
  comHandleIndexUsart3,
#endif
#ifdef COM_USB_ENABLE
  comHandleIndexUsb,
#endif
#ifdef COM_LEUART0_ENABLE
  comHandleIndexLeuart0,
#endif
#ifdef COM_LEUART1_ENABLE
  comHandleIndexLeuart1,
#endif
  comHandleIndexSize
} COM_HandleIndex_t;
// COM handles
static COM_HandleData_t comhandledata[comHandleIndexSize];

