lixpaulian/efr32xx-rail/platform/base/hal/plugin/serial/cortexm/efm32/com.c
// --------------------------------
// UART handle array indexes
#if defined(COM_UART_ENABLE)
typedef enum COM_UartHandleIndex {
#ifdef COM_USART0_ENABLE
  comUartHandleIndexUsart0,
#endif
#ifdef COM_USART1_ENABLE
  comUartHandleIndexUsart1,
#endif
#ifdef COM_USART2_ENABLE
  comUartHandleIndexUsart2,
#endif
#ifdef COM_USART3_ENABLE
  comUartHandleIndexUsart3,
#endif
#ifdef COM_LEUART0_ENABLE
  comUartHandleIndexLeuart0,
#endif
#ifdef COM_LEUART1_ENABLE
  comUartHandleIndexLeuart1,
#endif
  comUartHandleIndexSize
} COM_UartHandleIndex_t;
// UART handles
static UARTDRV_HandleData_t uarthandledata[comUartHandleIndexSize];
#endif

// DMA interrupt state
uint32_t dma_IEN;

static inline bool checkValidPort(COM_Port_t port)
{
  switch (port) {
#ifdef COM_VCP_ENABLE
    case COM_VCP:
    case comPortVcp:
      return true;
#endif
#ifdef COM_USART0_ENABLE
    case COM_USART0:
    case comPortUsart0:
      return true;
#endif
#ifdef COM_USART1_ENABLE
    case COM_USART1:
    case comPortUsart1:
      return true;
#endif
#ifdef COM_USART2_ENABLE
    case COM_USART2:
    case comPortUsart2:
      return true;
#endif
#ifdef COM_USART3_ENABLE
    case comPortUsart3:
      return true;
#endif
#ifdef COM_USB_ENABLE
    case COM_USB:
    case comPortUsb:
      return true;
#endif
#ifdef COM_LEUART0_ENABLE
    case COM_LEUART0:
    case comPortLeuart0:
      return true;
#endif
#ifdef COM_LEUART1_ENABLE
    case COM_LEUART1:
    case comPortLeuart1:
      return true;
#endif
    default:
      return false;
  }
}

static bool checkValidThresholds(COM_Handle_t comhandle)
{
  // COM will issue an XOFF when free buffer space <= rxStop bytes and an XON
  // when free buffer space >= rxStart bytes.
  // Stop threshold must be lower than the start threshold or else it's
  // unclear whether or not to start/stop when buffer is in between.
  if (comhandle->rxStart < comhandle->rxStop) {
    return false;
  }

  // Start threshold and size must be multiples of the stop threshold unless
  // using software flow control.
  if ( (comhandle->uarthandle->fcType != uartdrvFlowControlSw)
       && ( (comhandle->rxsize % comhandle->rxStop != 0)
            || (comhandle->rxStart % comhandle->rxStop != 0) ) ) {
    return false;
  }

  // return true if no bad configuration found
  return true;
}

static void dequeueFifoBuffer(COM_Handle_t comhandle, uint16_t count)
{
  CORE_DECLARE_IRQ_STATE;
  CORE_ENTER_ATOMIC();
  FIFO_DEQUEUE_MULTIPLE(comhandle->txQueue, comhandle->txsize, count);
  CORE_EXIT_ATOMIC();
}

/**
 * @brief Convert a COM_Port_t into a pointer to COM handle
 *
 * @param[in] port COM port number
 *
 * @return Pointer to COM handle
 */
static COM_Handle_t getComHandleFromPort(COM_Port_t port)
{
  size_t index;

  switch (port) {
#ifdef COM_VCP_ENABLE
    case COM_VCP:
    case comPortVcp:
      index = comHandleIndexVcp;
      break;
#endif
#ifdef COM_USART0_ENABLE
    case COM_USART0:
    case comPortUsart0:
      index = comHandleIndexUsart0;
      break;
#endif
#ifdef COM_USART1_ENABLE
    case COM_USART1:
    case comPortUsart1:
      index = comHandleIndexUsart1;
      break;
#endif
#ifdef COM_USART2_ENABLE
    case COM_USART2:
    case comPortUsart2:
      index = comHandleIndexUsart2;
      break;
#endif
#ifdef COM_USART3_ENABLE
    case comPortUsart3:
      index = comHandleIndexUsart3;
      break;
#endif
#ifdef COM_USB_ENABLE
    case COM_USB:
    case comPortUsb:
      index = comHandleIndexUsart0;
      break;
#endif
#ifdef COM_LEUART0_ENABLE
    case COM_LEUART0:
    case comPortLeuart0:
      index = comHandleIndexLeuart0;
      break;
#endif
#ifdef COM_LEUART1_ENABLE
    case COM_LEUART1:
    case comPortLeuart1:
      index = comHandleIndexLeuart1;
      break;
#endif
    default:
      assert(false);
      // Will never reach this line
      return comhandledata;
  }

  return &comhandledata[index];
}

static inline bool getOutputFifoSpace(COM_Handle_t comhandle, uint8_t extraByteCount)
{
  return (comhandle->txQueue->used < comhandle->txsize - extraByteCount);
}

static inline bool getInputFifoSpace(COM_Handle_t comhandle, uint8_t extraByteCount)
{
  return (comhandle->rxQueue->used < comhandle->rxsize - extraByteCount);
}

static void pumpRx(COM_Port_t port)
{
  if (checkValidPort(port) == false) {
    return;
  }
  // UART
#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    COM_Handle_t comhandle = getComHandleFromPort(port);
    uint8_t *buf;
    UARTDRV_Count_t xferred, remaining;
    CORE_ATOMIC_SECTION(
      UARTDRV_GetReceiveStatus(comhandle->uarthandle, &buf, &xferred, &remaining);
      updateBuffer(comhandle->rxQueue, xferred, comhandle->rxsize);
      )
    // Enable flow control if appropriate after updating buffer
    if ((UARTDRV_FlowControlGetSelfStatus(comhandle->uarthandle) == uartdrvFlowControlOff)
        && ((comhandle->rxsize - comhandle->rxQueue->used)
            >= comhandle->rxStart)) {
      // Only enable flow control if DMAs are set up when using HW flow control
      if (((comhandle->uarthandle->fcType == uartdrvFlowControlHw)
           && (UARTDRV_GetReceiveDepth(comhandle->uarthandle) >= 2))
          || (comhandle->uarthandle->fcType == uartdrvFlowControlSw)) {
        UARTDRV_FlowControlSet(comhandle->uarthandle, uartdrvFlowControlOn);
      }
    }
  }
#endif
#ifdef COM_VCP_ENABLE
  if (port == COM_VCP) {
    emDebugReceiveData();
    return;
  }
#endif
}

#if HAL_SERIAL_RXWAKE_ENABLE
/* Enable interrupt on the UART RX pin, in order to be able to wakeup on rx
 * activity in energy modes where the UART is not available. */
static void rxGpioIntEnable(void)
{
#ifdef CORTEXM3_EFM32_MICRO
  GPIO_IntClear(1 << UART_RX_INT_PIN);
  GPIO_IntEnable(1 << UART_RX_INT_PIN);
#endif
}

/* Disable interrupt on the UART RX pin */
static void rxGpioIntDisable(void)
{
#ifdef CORTEXM3_EFM32_MICRO
  GPIO_IntDisable(1 << UART_RX_INT_PIN);
  GPIO_IntClear(1 << UART_RX_INT_PIN);
#endif
}
#endif

/**
 * Set RX/TX queues in COM handle based on given COM port
 */
static Ecode_t setComHandleQueues(COM_Port_t port)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  switch (port) {
#ifdef COM_VCP_ENABLE
    case COM_VCP:
    case comPortVcp:
      comhandle->rxQueue = (COM_FifoQueue_t *)&comFifoQueueRxVcp;
      comhandle->txQueue = (COM_FifoQueue_t *)&comFifoQueueTxVcp;
      comhandle->rxsize = COM_VCP_RX_QUEUE_SIZE;
      comhandle->txsize = COM_VCP_TX_QUEUE_SIZE;
      break;
#endif
#ifdef COM_USART0_ENABLE
    case COM_USART0:
    case comPortUsart0:
      comhandle->rxQueue = (COM_FifoQueue_t *)&comFifoQueueRxUsart0;
      comhandle->txQueue = (COM_FifoQueue_t *)&comFifoQueueTxUsart0;
      comhandle->rxsize = COM_USART0_RX_QUEUE_SIZE;
      comhandle->txsize = COM_USART0_TX_QUEUE_SIZE;
      break;
#endif
#ifdef COM_USART1_ENABLE
    case COM_USART1:
    case comPortUsart1:
      comhandle->rxQueue = (COM_FifoQueue_t *)&comFifoQueueRxUsart1;
      comhandle->txQueue = (COM_FifoQueue_t *)&comFifoQueueTxUsart1;
      comhandle->rxsize = COM_USART1_RX_QUEUE_SIZE;
      comhandle->txsize = COM_USART1_TX_QUEUE_SIZE;
      break;
#endif
#ifdef COM_USART2_ENABLE
    case COM_USART2:
    case comPortUsart2:
      comhandle->rxQueue = (COM_FifoQueue_t *)&comFifoQueueRxUsart2;
      comhandle->txQueue = (COM_FifoQueue_t *)&comFifoQueueTxUsart2;
      comhandle->rxsize = COM_USART2_RX_QUEUE_SIZE;
      comhandle->txsize = COM_USART2_TX_QUEUE_SIZE;
      break;
#endif
#ifdef COM_USART3_ENABLE
    case comPortUsart3:
      comhandle->rxQueue = (COM_FifoQueue_t *)&comFifoQueueRxUsart3;
      comhandle->txQueue = (COM_FifoQueue_t *)&comFifoQueueTxUsart3;
      comhandle->rxsize = COM_USART3_RX_QUEUE_SIZE;
      comhandle->txsize = COM_USART3_TX_QUEUE_SIZE;
      break;
#endif
#ifdef COM_LEUART0_ENABLE
    case COM_LEUART0:
    case comPortLeuart0:
      comhandle->rxQueue = (COM_FifoQueue_t *)&comFifoQueueRxLeuart0;
      comhandle->txQueue = (COM_FifoQueue_t *)&comFifoQueueTxLeuart0;
      comhandle->rxsize = COM_LEUART0_RX_QUEUE_SIZE;
      comhandle->txsize = COM_LEUART0_TX_QUEUE_SIZE;
      break;
#endif
#ifdef COM_LEUART1_ENABLE
    case COM_LEUART1:
    case comPortLeuart1:
      comhandle->rxQueue = (COM_FifoQueue_t *)&comFifoQueueRxLeuart1;
      comhandle->txQueue = (COM_FifoQueue_t *)&comFifoQueueTxLeuart1;
      comhandle->rxsize = COM_LEUART1_RX_QUEUE_SIZE;
      comhandle->txsize = COM_LEUART1_TX_QUEUE_SIZE;
      break;
#endif
    default:
      return EMBER_ERR_FATAL;
      break;
  }

  return EMBER_SUCCESS;
}

