lixpaulian/efr32xx-rail/platform/base/hal/plugin/serial/cortexm/efm32/com.c
#endif //defined(COM_UART_ENABLE)

void COM_RX_IRQHandler(COM_Port_t port, uint8_t byte)
{
  UARTDRV_FlowControlState_t fcState;
  uint16_t freeSpace;
  COM_Handle_t comhandle = getComHandleFromPort(port);

  // Intercept and handle flow control bytes
  if (byte == UARTDRV_FC_SW_XON) {
    UARTDRV_FlowControlSetPeerStatus(comhandle->uarthandle, uartdrvFlowControlOn);
    comhandle->txPaused = false;
    // Transmit queued data in the TX FIFO queue
    txCatchUp(comhandle);
  } else if (byte == UARTDRV_FC_SW_XOFF) {
    UARTDRV_FlowControlSetPeerStatus(comhandle->uarthandle, uartdrvFlowControlOff);
    comhandle->txPaused = true;
  } else {
    // store byte in RX FIFO
    FIFO_ENQUEUE(comhandle->rxQueue, byte, comhandle->rxsize);
    // Send flow control byte if threshold exceeded
    fcState = UARTDRV_FlowControlGetSelfStatus(comhandle->uarthandle);
    freeSpace = comhandle->rxsize - comhandle->rxQueue->used;
    if ((fcState == uartdrvFlowControlOn) && (freeSpace <= comhandle->rxStop)) {
      UARTDRV_FlowControlSet(comhandle->uarthandle, uartdrvFlowControlOff);
    } else if ((fcState == uartdrvFlowControlOff) && (freeSpace >= comhandle->rxStart)) {
      UARTDRV_FlowControlSet(comhandle->uarthandle, uartdrvFlowControlOn);
    }
  }
}

#ifdef COM_USART0_ENABLE
void USART0_RX_IRQHandler(void)
{
  if (USART0->STATUS & USART_STATUS_RXDATAV) {
    COM_RX_IRQHandler(COM_USART0, USART_Rx(USART0));
  }
}

#endif

#ifdef COM_USART1_ENABLE
void USART1_RX_IRQHandler(void)
{
  if (USART1->STATUS & USART_STATUS_RXDATAV) {
    COM_RX_IRQHandler(COM_USART1, USART_Rx(USART1));
  }
}

#endif

#ifdef COM_USART2_ENABLE
void USART2_RX_IRQHandler(void)
{
  if (USART2->STATUS & USART_STATUS_RXDATAV) {
    COM_RX_IRQHandler(COM_USART2, USART_Rx(USART2));
  }
}

#endif

#ifdef COM_USART3_ENABLE
void USART3_RX_IRQHandler(void)
{
  if (USART3->STATUS & USART_STATUS_RXDATAV) {
    COM_RX_IRQHandler(comPortUsart3, USART_Rx(USART3));
  }
}

#endif

/* "power down" COM by switching from DMA to UART byte interrupts */
void COM_InternalPowerDown()
{
#if (LDMA_COUNT > 0)
  if (LDMA->IEN != 0) {
    dma_IEN = LDMA->IEN;
    LDMA->IEN = 0;
  }
#else
  if (DMA->IEN != 0) {
    dma_IEN = DMA->IEN;
    DMA->IEN = 0;
  }
#endif
  #ifdef COM_USART0_ENABLE
  NVIC_ClearPendingIRQ(USART0_RX_IRQn);
  NVIC_EnableIRQ(USART0_RX_IRQn);
  USART_IntEnable(USART0, USART_IF_RXDATAV);
  #endif
  #ifdef COM_USART1_ENABLE
  NVIC_ClearPendingIRQ(USART1_RX_IRQn);
  NVIC_EnableIRQ(USART1_RX_IRQn);
  USART_IntEnable(USART1, USART_IF_RXDATAV);
  #endif
  #ifdef COM_USART2_ENABLE
  NVIC_ClearPendingIRQ(USART2_RX_IRQn);
  NVIC_EnableIRQ(USART2_RX_IRQn);
  USART_IntEnable(USART2, USART_IF_RXDATAV);
  #endif
  #ifdef COM_USART3_ENABLE
  NVIC_ClearPendingIRQ(USART3_RX_IRQn);
  NVIC_EnableIRQ(USART3_RX_IRQn);
  USART_IntEnable(USART3, USART_IF_RXDATAV);
  #endif
#if (HAL_SERIAL_RXWAKE_ENABLE)
  rxGpioIntEnable();
#endif
}

/* "power up" COM by switching back to DMA interrupts */
void COM_InternalPowerUp()
{
  #ifdef COM_USART0_ENABLE
  USART_IntClear(USART0, USART_IF_RXDATAV);
  USART_IntDisable(USART0, USART_IF_RXDATAV);
  NVIC_ClearPendingIRQ(USART0_RX_IRQn);
  NVIC_DisableIRQ(USART0_RX_IRQn);
  #endif
  #ifdef COM_USART1_ENABLE
  USART_IntClear(USART1, USART_IF_RXDATAV);
  USART_IntDisable(USART1, USART_IF_RXDATAV);
  NVIC_ClearPendingIRQ(USART1_RX_IRQn);
  NVIC_DisableIRQ(USART1_RX_IRQn);
  #endif
  #ifdef COM_USART2_ENABLE
  USART_IntClear(USART2, USART_IF_RXDATAV);
  USART_IntDisable(USART2, USART_IF_RXDATAV);
  NVIC_ClearPendingIRQ(USART2_RX_IRQn);
  NVIC_DisableIRQ(USART2_RX_IRQn);
  #endif
  #ifdef COM_USART3_ENABLE
  USART_IntClear(USART3, USART_IF_RXDATAV);
  USART_IntDisable(USART3, USART_IF_RXDATAV);
  NVIC_ClearPendingIRQ(USART3_RX_IRQn);
  NVIC_DisableIRQ(USART3_RX_IRQn);
  #endif
  if (dma_IEN != 0) {
#if (LDMA_COUNT > 0)
    LDMA->IEN = dma_IEN;
#else
    DMA->IEN = dma_IEN;
#endif
  }
#if (HAL_SERIAL_RXWAKE_ENABLE)
  rxGpioIntDisable();
#endif
}

/* Inject data into the RX FIFO */
Ecode_t COM_InternalReceiveData(COM_Port_t port, uint8_t *data, uint32_t length)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  // Check for space for this message in the FIFO
  if (!getInputFifoSpace(comhandle, length)) {
    return EMBER_ERR_FATAL;
  }

  for (uint32_t i = 0; i < length; i++) {
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_ATOMIC();
    FIFO_ENQUEUE(comhandle->rxQueue, *data, comhandle->rxsize);
    CORE_EXIT_ATOMIC();
    data++;
  }

  return EMBER_SUCCESS;
}

bool COM_InternalRxIsPaused(COM_Port_t port)
{
  // UART
#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    COM_Handle_t comhandle = getComHandleFromPort(port);
    return (UARTDRV_FlowControlGetSelfStatus(comhandle->uarthandle) == uartdrvFlowControlOff);
  }
#endif
  return false;
}

bool COM_InternalTxIsIdle(COM_Port_t port)
{
  // UART
#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    COM_Handle_t comhandle = getComHandleFromPort(port);
    return (UARTDRV_GetPeripheralStatus(comhandle->uarthandle) & UARTDRV_STATUS_TXIDLE) ? true : false;
  }
#endif
  return false;
}

bool COM_InternalTxIsPaused(COM_Port_t port)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  return comhandle->txPaused;
}

//------------------------------------------------------
// Serial initialization

Ecode_t COM_Init(COM_Port_t port, COM_Init_t *init)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  if (!COM_Unused(port)) {
    // Port already configured; reinitialize
    COM_DeInit(port);
  }

  COM_Handle_t comhandle = getComHandleFromPort(port);

  if (setComHandleQueues(port) != EMBER_SUCCESS) {
    return EMBER_ERR_FATAL;
  }

  // VCP
#if (COM_VCP_PORTS > 0) && defined(COM_VCP_ENABLE)
  if (checkValidVcpPort(port)) {
    return emDebugInit();
  }
#endif

  // UART
#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    Ecode_t status;

    comhandle->uarthandle = getUartHandleFromPort(port);

    // add rx/tx buffer queue to initdata
    if (setUartBufferQueues(port, init) != EMBER_SUCCESS) {
      return EMBER_ERR_FATAL;
    }

    // store RX flow control thresholds
    comhandle->rxStop = init->rxStop;
    comhandle->rxStart = init->rxStart;

    if (!checkValidThresholds(comhandle)) {
      // Reset COM handle
      memset(comhandle, 0, sizeof(COM_HandleData_t));
      return EMBER_BAD_ARGUMENT;
    }

    // iniitalize hardware
    if (checkValidLeuartPort(port)) {
      status = UARTDRV_InitLeuart(comhandle->uarthandle, &init->uartdrvinit.leuartinit);
    } else { //USART
      status = UARTDRV_InitUart(comhandle->uarthandle, &init->uartdrvinit.uartinit);
    }
    if (status != EMBER_SUCCESS) {
      return status;
    }
    GPIO_PinModeSet(comhandle->uarthandle->rxPort,
                    comhandle->uarthandle->rxPin,
                    gpioModeInputPull,
                    1);

    if ((checkValidLeuartPort(port)
         && (init->uartdrvinit.leuartinit.fcType == uartdrvFlowControlSw))
        || (!checkValidLeuartPort(port)
            && (init->uartdrvinit.uartinit.fcType == uartdrvFlowControlSw))) {
      enableRxIrq(port, true);
      // begin by sending XON
      UARTDRV_FlowControlSet(comhandle->uarthandle, uartdrvFlowControlOn);
    } else {
      comhandle->bufferIndex = 0;
      comhandle->bufferLimit = comhandle->rxsize / comhandle->rxStop;

      // start ping pong buffers for FIFO
      rxNextBuffer(comhandle);
      rxNextBuffer(comhandle);
    }
  }
#endif // COM_UART_ENABLE
  COM_RxGpioWakeInit();

  return EMBER_SUCCESS;
}

Ecode_t COM_DeInit(COM_Port_t port)
{
  COM_Handle_t comhandle;
  Ecode_t status;

  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  if (COM_Unused(port)) {
    return EMBER_SUCCESS;
  }

  COM_FlushRx(port);

