lixpaulian/efr32xx-rail/platform/base/hal/plugin/serial/cortexm/efm32/com.c
  comhandle = getComHandleFromPort(port);

#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    status = UARTDRV_DeInit(comhandle->uarthandle);
    if (status != ECODE_EMDRV_UARTDRV_OK) {
      return status;
    }

    if (comhandle->uarthandle->fcType == uartdrvFlowControlSw) {
      enableRxIrq(port, false);
    }
#if (HAL_SERIAL_RXWAKE_ENABLE)
    rxGpioIntDisable();
#endif
  }
#endif
  memset(comhandle, 0, sizeof(COM_HandleData_t));
  return EMBER_SUCCESS;
}

//------------------------------------------------------
// Serial Input

// returns # bytes available for reading
uint16_t COM_ReadAvailable(COM_Port_t port)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  // make sure rx buffer is updated
  pumpRx(port);
  return comhandle->rxQueue->used;
}

Ecode_t COM_ReadByte(COM_Port_t port, uint8_t *dataByte)
{
  uint16_t nextRx;
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  COM_Handle_t comhandle = getComHandleFromPort(port);
  // make sure rx buffer is updated
  pumpRx(port);
  if (comhandle->rxQueue->used > 0) {
    CORE_DECLARE_IRQ_STATE;
    CORE_ENTER_ATOMIC();
    *dataByte = FIFO_DEQUEUE(comhandle->rxQueue, comhandle->rxsize);

      #ifdef COM_UART_ENABLE
    if (checkValidUartPort(port)
        && comhandle->uarthandle->fcType != uartdrvFlowControlSw) {
      while (UARTDRV_GetReceiveDepth(comhandle->uarthandle) < 2) {
        nextRx = comhandle->bufferIndex * comhandle->rxStop;
        if (((comhandle->rxQueue->tail < (nextRx + comhandle->rxStop))
             && (nextRx < comhandle->rxQueue->head))
            || ((comhandle->rxQueue->head < comhandle->rxQueue->tail)
                && (((nextRx + comhandle->rxStop) > comhandle->rxQueue->tail)
                    || (nextRx < comhandle->rxQueue->head)))) {
          break;
        }
        rxNextBuffer(comhandle);
      }
    }
      #endif //COM_UART_ENABLE
    CORE_EXIT_ATOMIC();
    return EMBER_SUCCESS;
  }
  return EMBER_SERIAL_RX_EMPTY;
}

Ecode_t COM_ReadData(COM_Port_t port,
                     uint8_t *data,
                     uint16_t length,
                     uint16_t *bytesRead)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  uint16_t bytesReadInternal = 0;
  Ecode_t status;

  while (bytesReadInternal < length) {
    status = COM_ReadByte(port, data);

    switch (status) {
      case EMBER_SUCCESS:
        ++data;
        ++bytesReadInternal;
        break;

      case EMBER_SERIAL_RX_EMPTY:
        // empty queue is not an error for us, we just want to keep waiting
        break;

      default:
        // only store number of bytes read if the caller provided a non-NULL pointer
        if (bytesRead) {
          *bytesRead = bytesReadInternal;
        }
        return status;
    }
  }

  // only store number of bytes read if the caller provided a non-NULL pointer
  if (bytesRead) {
    *bytesRead = bytesReadInternal;
  }

  return EMBER_SUCCESS;
}

#ifndef EMBER_TEST
Ecode_t COM_ReadDataTimeout(COM_Port_t port,
                            uint8_t *data,
                            uint16_t length,
                            uint16_t *bytesRead,
                            uint16_t firstByteTimeout,
                            uint16_t subsequentByteTimeout)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  uint16_t bytesReadInternal = 0;
  Ecode_t status;
  uint16_t timeout = firstByteTimeout;
  uint16_t startTime = halCommonGetInt16uMillisecondTick();

  // loop until we read the max number of bytes or the timeout elapses
  while (bytesReadInternal < length
         && elapsedTimeInt16u(startTime, halCommonGetInt16uMillisecondTick()) < timeout) {
    status = COM_ReadByte(port, data);

    switch (status) {
      case EMBER_SUCCESS:
        ++data;
        ++bytesReadInternal;
        // reset timer and timeout for next character
        startTime = halCommonGetInt16uMillisecondTick();
        timeout = subsequentByteTimeout;
        break;

      case EMBER_SERIAL_RX_EMPTY:
        // empty queue is not an error for us, we just want to keep waiting
        break;

      default:
        // only store number of bytes read if the caller provided a non-NULL pointer
        if (bytesRead) {
          *bytesRead = bytesReadInternal;
        }
        return status;
    }
  }

  // only store number of bytes read if the caller provided a non-NULL pointer
  if (bytesRead) {
    *bytesRead = bytesReadInternal;
  }

  return bytesReadInternal == length ? EMBER_SUCCESS : EMBER_SERIAL_RX_EMPTY;
}

#endif // EMBER_TEST

Ecode_t COM_ReadPartialLine(COM_Port_t port, char *data, uint8_t max, uint8_t * index)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  Ecode_t err;
  uint8_t ch;

  if (((*index) == 0) || ((*index) >= max)) {
    data[0] = '\0';
  }

  for (;; ) {
    err = COM_ReadByte(port, &ch);

    // no new serial port char?, keep looping
    if (err) {
      return err;
    }

    // handle bogus characters
    if ( ch > 0x7F ) {
      continue;
    }

    // handle leading newline - fogBUGZ # 584
    if (((*index) == 0)
        && ((ch == '\n') || (ch == 0))) {
      continue;
    }

    // Drop the CR, or NULL that is part of EOL sequence.
    if ((*index) >= max) {
      *index = 0;
      if ((ch == '\r') || (ch == 0)) {
        continue;
      }
    }

    // handle backspace
    if ( ch == 0x8 || ch == 0x7F ) {
      if ((*index) > 0 ) {
        // delete the last character from our string
        (*index)--;
        data[*index] = '\0';
        // echo backspace
        COM_WriteString(port, "\b \b");
      }
      // don't add or process this character
      continue;
    }

    //if the string is about to overflow, fake in a CR
    if ((*index) + 2 > max ) {
      ch = '\r';
    }

    COM_WriteByte(port, ch);  // term char echo

    //upcase that char
    if ( ch >= 'a' && ch <= 'z') {
      ch = ch - ('a' - 'A');
    }

    // build a string until we press enter
    if ((ch == '\r') || (ch == '\n')) {
      data[*index] = '\0';

