lixpaulian/efr32xx-rail/platform/base/hal/plugin/serial/cortexm/efm32/com.c
Ecode_t COM_WaitSend(COM_Port_t port)
{
  if (checkValidPort(port) == false) {
    return EMBER_ERR_FATAL;
  }
  COM_Handle_t comhandle = getComHandleFromPort(port);

#if defined(COM_VCP_ENABLE)
  if (checkValidVcpPort(port)) {
    while (comhandle->txQueue->used > 0) ;
  }
#endif
#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    while ((comhandle->txQueue->used > 0)
           || (UARTDRV_GetTransmitDepth(comhandle->uarthandle) > 0)
           || !((UARTDRV_GetPeripheralStatus(comhandle->uarthandle) & UARTDRV_STATUS_TXC)
                && (UARTDRV_GetPeripheralStatus(comhandle->uarthandle) & UARTDRV_STATUS_TXIDLE)
                )) ;
  }
#endif

  return EMBER_SUCCESS;
}

//------------------------------------------------------
// Serial buffer maintenance
void COM_FlushRx(COM_Port_t port)
{
  COM_Handle_t comhandle = getComHandleFromPort(port);
  COM_FifoQueue_t *q = comhandle->rxQueue;

#if defined(COM_UART_ENABLE)
  if (checkValidUartPort(port)) {
    if (comhandle->uarthandle->fcType != uartdrvFlowControlSw) {
      UARTDRV_Abort(comhandle->uarthandle, uartdrvAbortReceive);

      // reset buffer index
      comhandle->bufferIndex = 0;

      // restart buffers for FIFO
      rxNextBuffer(comhandle);
      rxNextBuffer(comhandle);
    }
  }
#endif

  ATOMIC_LITE(
    q->used = 0;
    q->head = 0;
    q->tail = 0;
    q->pumped = 0;
    )
}

bool COM_Unused(uint8_t port)
{
  if (checkValidPort(port) == false) {
    return true;
  }

  COM_Handle_t comhandle = getComHandleFromPort((COM_Port_t) port);
  if (comhandle == NULL) {
    return true;
  }
  // use rxQueue as a proxy for a COM port being initialized. Will be a null
  // pointer if uninitialized
  return !((bool) comhandle->rxQueue);
}

/* Initialize the UART RX pin as a GPIO Interrupt. GPIO Interrupt is used
 * in order to be able to wakeup on rx activity in energy modes when the
 * UART peripheral is not available. */
void COM_RxGpioWakeInit(void)
{
#if HAL_SERIAL_RXWAKE_ENABLE
  GPIO_ExtIntConfig(UART_RX_INT_PORT, UART_RX_INT_PIN, UART_RX_INT_PIN, false, true, false);
#endif
}

#else // defined (COM_VCP_ENABLE) || defined (COM_UART_ENABLE)
// COM API stubs if no COM ports are enabled
void COM_InternalPowerDown()
{
}
void COM_InternalPowerUp()
{
}
bool COM_InternalTxIsIdle(COM_Port_t port)
{
  return true;
}
bool COM_InternalRxIsPaused(COM_Port_t port)
{
  return false;
}
bool COM_InternalTxIsPaused(COM_Port_t port)
{
  return false;
}
Ecode_t COM_InternalReceiveData(COM_Port_t port, uint8_t *data, uint32_t length)
{
  return ECODE_EMDRV_UARTDRV_OK;
}

Ecode_t COM_Init(COM_Port_t port, COM_Init_t *init)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_DeInit(COM_Port_t port)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
uint16_t COM_ReadAvailable(COM_Port_t port)
{
  return 0;
}
Ecode_t COM_ReadByte(COM_Port_t port, uint8_t *dataByte)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_ReadData(COM_Port_t port,
                     uint8_t *data,
                     uint16_t length,
                     uint16_t *bytesRead)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_ReadDataTimeout(COM_Port_t port,
                            uint8_t *data,
                            uint16_t length,
                            uint16_t *bytesRead,
                            uint16_t firstByteTimeout,
                            uint16_t subsequentByteTimeout)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_ReadPartialLine(COM_Port_t port, char *data, uint8_t max, uint8_t * index)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_ReadLine(COM_Port_t port, char *data, uint8_t max)
{
  return ECODE_EMDRV_UARTDRV_OK;
}

Ecode_t COM_ForceWriteData(COM_Port_t port, uint8_t *data, uint8_t length)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
uint16_t COM_WriteAvailable(COM_Port_t port)
{
  return 0;
}
uint16_t COM_WriteUsed(COM_Port_t port)
{
  return 0;
}
Ecode_t COM_WriteByte(COM_Port_t port, uint8_t dataByte)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_WriteHex(COM_Port_t port, uint8_t dataByte)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_WriteString(COM_Port_t port, PGM_P string)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_PrintCarriageReturn(COM_Port_t port)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_Printf(COM_Port_t port, PGM_P formatString, ...)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_PrintfVarArg(COM_Port_t port, PGM_P formatString, va_list ap)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_PrintfLine(COM_Port_t port, PGM_P formatString, ...)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_WriteData(COM_Port_t port, uint8_t *data, uint8_t length)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_GuaranteedPrintf(COM_Port_t port, PGM_P formatString, ...)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
Ecode_t COM_WaitSend(COM_Port_t port)
{
  return ECODE_EMDRV_UARTDRV_OK;
}
void COM_FlushRx(COM_Port_t port)
{
}
bool COM_Unused(uint8_t port)
{
  return true;
}
void COM_RxGpioWakeInit()
{
}

#endif // defined (COM_VCP_ENABLE) || defined (COM_UART_ENABLE)
